CFDEM/CFDEMcoupling-PUBLIC-5.x/tutorials/cfdemSolverPiso/periodicChannel/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;//0.008;

vertices
(
    (0. 0. 0.)
    (0.4 0. 0.)
    (0.4 0.1 0.)
    (0. 0.1 0.)
    (0. 0. 0.1)
    (0.4 0. 0.1)
    (0.4 0.1 0.1)
    (0. 0.1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (32 8 8) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    wall
    {
        type wall;
        faces
        (
        (0 3 2 1)//bottom
        (4 5 6 7)//top
        (1 5 4 0)//front
        (3 7 6 2)//back
        );
    }

    outlet
    {
        type cyclic;//cyclicAMI;
        neighbourPatch inlet;
        transform translational;
        separationVector (-0.4 0 0);
        faces
        (
        (2 6 5 1)//outlet
        );
    }

    inlet
    {
        type cyclic;//cyclicAMI;
        neighbourPatch outlet;
        transform translational;
        separationVector (0.4 0 0);
        faces
        (
        (0 4 7 3)//inlet
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
